#ifndef MYCLASS_H
#define MYCLASS_H

class MyClass {
public:
    /**
     * FuncA
     * Обчислює наближене значення функції ch(x) як суму перших n елементів ряду
     * чим більша кількість елементів, тим точніше наближення.
     * 
     * @param n Кількість елементів ряду, які будуть використані для обчислення.
     *          Чим більше n, тим точніше буде наближення.
     * @param x Аргумент функції ch(x), значення якого буде підставлене в ряд.
     *          Це може бути будь-яке дійсне чи комплексне число.
     * @return Наближене значення функції ch(x) після обчислення перших n елементів.
     */
    double FuncA(int n, double x);
};

#endif // MYCLASS_H

